Tekla.Structures.CatalogInternal.dotcatShapeEnumerator_t
Serialization structure for shape and shape Enumerator

Tekla.Structures.CatalogInternal.dotcatShapeEnumerator_t.MoreShapesLeft


Tekla.Structures.CatalogInternal.dotcatShapeEnumerator_t.IndexToStart


Tekla.Structures.CatalogInternal.dotcatShapeEnumerator_t.nShapes
Number of the shapes in the enumerator.

Tekla.Structures.CatalogInternal.dotcatShapeEnumerator_t.aData
Shape enumerator data

Tekla.Structures.CatalogInternal.dotcatShapeEnumerator_t.ClientId
